<!-- placeholder-1 -->
```fish
terraform plan -chdir='terraform/development/vpc'
```
<!-- placeholder-2 -->

<details><summary>Diff of changes.</summary>

```diff
+ aws_instance.a4l_bastion will be created
+ aws_instance.a4l_internal will be created
+ aws_key_pair.a4l will be created
+ aws_security_group.bastion will be created
+ aws_security_group.internal will be created
+ aws_security_group_rule.bastion_egress["10.16.160.0/20"] will be created
+ aws_security_group_rule.bastion_egress["10.16.32.0/20"] will be created
+ aws_security_group_rule.bastion_egress["10.16.96.0/20"] will be created
+ aws_security_group_rule.bastion_ingress["192.0.2.1/32"] will be created
+ aws_security_group_rule.internal_egress will be created
+ aws_security_group_rule.internal_ingress will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 11 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @chris3ware at 2024-10-31T15:59:56Z [(view log)](https://github.com/3ware/aws-network-speciality/actions/runs/11615453159/job/32346079218#step:17:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.a4l_bastion will be created
  + resource "aws_instance" "a4l_bastion" {
      + ami                                  = "ami-033b95fb8079dc481"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "A4L"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-09b05bf6cc10033cc"
      + tags                                 = {
          + "Name" = "A4L-BASTION"
        }
      + tags_all                             = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-development"
          + "Name"                       = "A4L-BASTION"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_instance.a4l_internal will be created
  + resource "aws_instance" "a4l_internal" {
      + ami                                  = "ami-033b95fb8079dc481"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "A4L"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0a17b3c8baaaa6df6"
      + tags                                 = {
          + "Name" = "A4L-INTERNAL-TEST"
        }
      + tags_all                             = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-development"
          + "Name"                       = "A4L-INTERNAL-TEST"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_key_pair.a4l will be created
  + resource "aws_key_pair" "a4l" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "A4L"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMNSplDEGibL7tUs87JsuwnHmDA2uSB+M2kUlOQuI0Fc"
      + tags_all        = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-development"
        }
    }

  # aws_security_group.bastion will be created
  + resource "aws_security_group" "bastion" {
      + arn                    = (known after apply)
      + description            = "Security Group for A4L Bastion Host"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "A4L-BASTION"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "A4L-BASTION"
        }
      + tags_all               = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-development"
          + "Name"                       = "A4L-BASTION"
        }
      + vpc_id                 = "vpc-0f9ba54f4696f7abf"
    }

  # aws_security_group.internal will be created
  + resource "aws_security_group" "internal" {
      + arn                    = (known after apply)
      + description            = "Security Group for A4L internal Host"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "A4L-INTERNAL"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "A4L-INTERNAL"
        }
      + tags_all               = {
          + "3ware:environment"          = "development"
          + "3ware:managed-by-terraform" = "true"
          + "3ware:project-id"           = "aws-network-speciality"
          + "3ware:service"              = "vpc"
          + "3ware:workspace"            = "vpc-us-east-1-development"
          + "Name"                       = "A4L-INTERNAL"
        }
      + vpc_id                 = "vpc-0f9ba54f4696f7abf"
    }

  # aws_security_group_rule.bastion_egress["10.16.160.0/20"] will be created
  + resource "aws_security_group_rule" "bastion_egress" {
      + cidr_blocks              = [
          + "10.16.160.0/20",
        ]
      + description              = "Outbound traffic private subnets"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "egress"
    }

  # aws_security_group_rule.bastion_egress["10.16.32.0/20"] will be created
  + resource "aws_security_group_rule" "bastion_egress" {
      + cidr_blocks              = [
          + "10.16.32.0/20",
        ]
      + description              = "Outbound traffic private subnets"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "egress"
    }

  # aws_security_group_rule.bastion_egress["10.16.96.0/20"] will be created
  + resource "aws_security_group_rule" "bastion_egress" {
      + cidr_blocks              = [
          + "10.16.96.0/20",
        ]
      + description              = "Outbound traffic private subnets"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "egress"
    }

  # aws_security_group_rule.bastion_ingress["192.0.2.1/32"] will be created
  + resource "aws_security_group_rule" "bastion_ingress" {
      + cidr_blocks              = [
          + "192.0.2.1/32",
        ]
      + description              = "Inbound traffic to bastion hosts"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # aws_security_group_rule.internal_egress will be created
  + resource "aws_security_group_rule" "internal_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Outbound traffic from internal hosts"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.internal_ingress will be created
  + resource "aws_security_group_rule" "internal_ingress" {
      + description              = "Inbound traffic to internal hosts"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bastion_hostname = (known after apply)
```
</details>
<!-- placeholder-5 -->
<!-- terraform.55...chdir..terraform.development.vpc..tf.plan -->
<!-- placeholder-6 -->